In [2]:
import numpy as np
import pandas as pd

In [3]:
df_excel = pd.read_excel("C:/Users/ibtes/Desktop/demo_set.xlsx")

In [7]:
df_excel.head(8)

   ID    Name  Joining_Year  Salary    Job_role  Age
0   1   James          2010     2.5        Lead   38
1   2  Raktim          2001     3.5     Manager   51
2   3     Bob          2003     3.0    Director   48
3   4    Rini          1999     3.5     Analyst   53
4   5     Max          2000     4.0   Team Lead   48
5   6  Rachel          2005     1.8  Technician   41
6   7   Priya          2009     2.5   Associate   39
7   8   Surya          2020     0.7        Lead   27

In [8]:
np.mean(df_excel.Salary)

2.62

In [9]:
df_excel

   ID    Name  Joining_Year  Salary    Job_role  Age
0   1   James          2010     2.5        Lead   38
1   2  Raktim          2001     3.5     Manager   51
2   3     Bob          2003     3.0    Director   48
3   4    Rini          1999     3.5     Analyst   53
4   5     Max          2000     4.0   Team Lead   48
5   6  Rachel          2005     1.8  Technician   41
6   7   Priya          2009     2.5   Associate   39
7   8   Surya          2020     0.7        Lead   27
8   9   Binny          2001     2.0     Manager   40
9  10   Shyam          2000     2.7        Lead   41

In [10]:
np.max(df_excel.Salary)

4.0

In [11]:
np.min(df_excel.Salary)

0.7

In [25]:
range_salary= np.max(df_excel.Salary) - np.min(df_excel.Salary)
print(range_Salary)

NameError: name 'range_Salary' is not defined

In [17]:
np.var(df_excel.Salary)

0.8375999999999999

In [18]:
np.sqrt(np.var(df_excel.Salary))

0.9152048950918039

In [19]:
np.std(df_excel.Salary)

0.9152048950918039

In [20]:
x= pd.Series(df_excel.Salary)

In [21]:
y= pd.Series(df_excel.Age)

In [22]:
x.cov(y)

6.642222222222222

In [23]:
df_excel.describe()

             ID  Joining_Year     Salary        Age
count  10.00000      10.00000  10.000000  10.000000
mean    5.50000    2004.80000   2.620000  42.600000
std     3.02765       6.56252   0.964711   7.647803
min     1.00000    1999.00000   0.700000  27.000000
25%     3.25000    2000.25000   2.125000  39.250000
50%     5.50000    2002.00000   2.600000  41.000000
75%     7.75000    2008.00000   3.375000  48.000000
max    10.00000    2020.00000   4.000000  53.000000